<?php

// +----------------------------------------------------------------------
// |万岳科技开源系统 [山东万岳信息科技有限公司]
// +----------------------------------------------------------------------
// | Copyright (c) 2020~2022 https://www.sdwanyue.com All rights reserved.
// +----------------------------------------------------------------------
// | 万岳科技相关开源系统代码并不是自由软件，未经授权许可不能去掉wanyue【万岳科技】相关版权并商用
// +----------------------------------------------------------------------
// | Author: 万岳科技开源官方 < wanyuekj2020@163.com >
// +----------------------------------------------------------------------

return [
//    'test' => [
//        'name'          => '用户登录',//用户操作名称
//        'score'         => 1,//更改积分，可以为负
//        'coin'          => 0,//更改金币，可以为负
//        'cycle_time'    => 1,//周期时间值
//        'cycle_type'    => 1,//周期类型;0:不限;1:按天;2:按小时;3:永久
//        'reward_number' => 1,//奖励次数
//        'url'           => [
//            'action' => 'portal/Test/test',
//            'param'  => ['id' => 1]
//        ],//执行操作的url
//    ]
];