<?php

// +----------------------------------------------------------------------
// |万岳科技开源系统 [山东万岳信息科技有限公司]
// +----------------------------------------------------------------------
// | Copyright (c) 2020~2022 https://www.sdwanyue.com All rights reserved.
// +----------------------------------------------------------------------
// | 万岳科技相关开源系统代码并不是自由软件，未经授权许可不能去掉wanyue【万岳科技】相关版权并商用
// +----------------------------------------------------------------------
// | Author: 万岳科技开源官方 < wanyuekj2020@163.com >
// +----------------------------------------------------------------------

namespace PhalApi\NotORM;

/**
 * 轻量级入口
 *
 * - 原来的NotORM是过程式的写法，在composer下不管需要与否都加载文件，影响性能
 * - 现在保持原来的实现，增加一个OOP的使用入口，从而使用到时再自动加载
 */

require_once dirname(__FILE__) . '/NotORM.php';

class Lite extends \NotORM {
}
