<?php
// +----------------------------------------------------------------------
// |万岳科技开源系统 [山东万岳信息科技有限公司]
// +----------------------------------------------------------------------
// | Copyright (c) 2020~2022 https://www.sdwanyue.com All rights reserved.
// +----------------------------------------------------------------------
// | 万岳科技相关开源系统代码并不是自由软件，未经授权许可不能去掉wanyue【万岳科技】相关版权并商用
// +----------------------------------------------------------------------
// | Author: 万岳科技开源官方 < wanyuekj2020@163.com >
// +----------------------------------------------------------------------

return [
    'ADMIN_TAG_ADD'    => '添加标签',
    'ADMIN_TAG_DELETE' => '删除标签',
    'ADMIN_TAG_INDEX'  => '标签列表',
    'SAVE_SUCCESS'     => '保存成功!',
    'DELETE_SUCCESS'   => '删除成功！',
    'ADD_SUCCESS'      => '添加成功',
    'DELETE_FAILED'    => '删除失败',
    'ADD_FAILED'       => '添加失败',
];

