<?php	
// +----------------------------------------------------------------------
// |万岳科技开源系统 [山东万岳信息科技有限公司]
// +----------------------------------------------------------------------
// | Copyright (c) 2020~2022 https://www.sdwanyue.com All rights reserved.
// +----------------------------------------------------------------------
// | 万岳科技相关开源系统代码并不是自由软件，未经授权许可不能去掉wanyue【万岳科技】相关版权并商用
// +----------------------------------------------------------------------
// | Author: 万岳科技开源官方 < wanyuekj2020@163.com >
// +----------------------------------------------------------------------
return array (
  'dsac/:id' => 
  array (
    0 => 'portal/Article/index?cid=5',
    1 => 
    array (
    ),
    2 => 
    array (
      'id' => '\\d+',
      'cid' => '\\d+',
    ),
  ),
  '阿斯顿/:id' => 
  array (
    0 => 'portal/Article/index?cid=6',
    1 => 
    array (
    ),
    2 => 
    array (
      'id' => '\\d+',
      'cid' => '\\d+',
    ),
  ),
  'dsac' => 
  array (
    0 => 'portal/List/index?id=5',
    1 => 
    array (
    ),
    2 => 
    array (
      'id' => '\\d+',
    ),
  ),
  '阿斯顿' => 
  array (
    0 => 'portal/List/index?id=6',
    1 => 
    array (
    ),
    2 => 
    array (
      'id' => '\\d+',
    ),
  ),
);