<?php

// +----------------------------------------------------------------------
// |万岳科技开源系统 [山东万岳信息科技有限公司]
// +----------------------------------------------------------------------
// | Copyright (c) 2020~2022 https://www.sdwanyue.com All rights reserved.
// +----------------------------------------------------------------------
// | 万岳科技相关开源系统代码并不是自由软件，未经授权许可不能去掉wanyue【万岳科技】相关版权并商用
// +----------------------------------------------------------------------
// | Author: 万岳科技开源官方 < wanyuekj2020@163.com >
// +----------------------------------------------------------------------

// 德语 de - de 德标
// 德语 de - at 奥地利
// 德语 de - ch 瑞士
// 德语 de - ru 俄罗斯(欧境)
return array(
	'Hi {name}, welcome to use PhalApi!' => '{name}Hallo, Willkommen PhalApi！',
	'user not exists' => 'Der nutzer gibt es nicht',
);
