<?php
// +----------------------------------------------------------------------
// |万岳科技开源系统 [山东万岳信息科技有限公司]
// +----------------------------------------------------------------------
// | Copyright (c) 2020~2022 https://www.sdwanyue.com All rights reserved.
// +----------------------------------------------------------------------
// | 万岳科技相关开源系统代码并不是自由软件，未经授权许可不能去掉wanyue【万岳科技】相关版权并商用
// +----------------------------------------------------------------------
// | Author: 万岳科技开源官方 < wanyuekj2020@163.com >
// +----------------------------------------------------------------------


return [
        // 默认跳转页面对应的模板文件

   'dispatch_error_tmpl'    => CMF_ROOT . 'themes/simpleboot3/error.html',
   //'exception_tmpl'    => CMF_ROOT . 'themes/simpleboot3/exception.html',

    // +----------------------------------------------------------------------
    // | 异常及错误设置
    // +----------------------------------------------------------------------

    // 异常页面的模板文件
   //'exception_tmpl'         => CMF_ROOT . '/themes/default/404.html',

    // 错误显示信息,非调试模式有效
    //'error_message'          => '页面错误！请稍后再试～',
    // 显示错误信息
    //'show_error_msg'         => false,
    // 异常处理handle类 留空使用 \think\exception\Handle
    //'exception_handle'       => '',
];


